gcc -g p4final.c
 ./a.out
enter n
8
enter array number
2
enter array number
3
enter array number
4
enter array number
5
enter array number
6
enter array number
7
enter array number
8
enter array number
9
sum is 44 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x88a: file p4final.c, line 32.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p4final.c:32
32  {
(gdb) n
34    n=input();
(gdb) s
input () at p4final.c:3
3   {
(gdb) n
5     printf("enter n\n");
(gdb) s
_IO_puts (str=0x558a20800974 "enter n") at ioputs.c:33
33  ioputs.c: No such file or directory.
(gdb) n
35  in ioputs.c
(gdb) c
Continuing.
enter n
8
enter array number
2
enter array number
3
enter array number
4
enter array number
5
enter array number
6
enter array number
7
enter array number
8
enter array number
9
sum is 44[Inferior 1 (process 717) exited normally]
(gdb)